# Taps
# --------------------------------
tap 'caskroom/cask'
tap 'homebrew/bundle'

# Binaries
# --------------------------------
brew 'bash-completion@2'
brew 'blueutil'
brew 'coreutils'
brew 'fzf'
brew 'git' # Updated git
brew 'git-lfs'
brew 'jq'
brew 'mas' # Mac App Store CLI
brew 'the_silver_searcher'
brew 'wifi-password'

# Apps
# --------------------------------
cask 'sequel-pro'
cask 'sublime-text'

# Quicklook
# --------------------------------
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Mac App Store
# --------------------------------
mas 'The Unarchiver', id: 425424353
