# Taps
# --------------------------------
tap 'caskroom/cask'
tap 'homebrew/bundle'

# Binaries
# --------------------------------
brew 'ansible'
brew 'bash-completion@2'
brew 'blueutil'
brew 'coreutils'
brew 'fzf'
brew 'git' # Updated git
brew 'git-lfs'
brew 'httpie'
brew 'jq'
brew 'mas' # Mac App Store CLI
brew 'node'
brew 'nvm'
brew 'php@7.1'
brew 'pv' # Pipe Viewer (https://www.ivarch.com/programs/pv.shtml)
brew 'the_silver_searcher'
brew 'wifi-password'

# Apps
# --------------------------------
# Custom Sequel Pro nightly version, until
# new version 1.2 is released.
cask './scripts/sequel-pro-nightly-cask.rb'
cask 'sublime-text'
cask 'p4v' # P4Merge

# Quicklook
# --------------------------------
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Mac App Store
# --------------------------------
mas 'The Unarchiver', id: 425424353
#mas 'Xcode', id: 497799835
